# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_container_registry.altinncr: Reading...
data.azurerm_container_registry.altinncr: Read complete after 0s [id=/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_api_management_diagnostic.application_insights will be created
  + resource "azurerm_api_management_diagnostic" "application_insights" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "altinn-apim-test-apim"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + resource_group_name       = "altinn-apim-test-rg"
      + sampling_percentage       = 0
      + verbosity                 = "information"

      + backend_request {
          + body_bytes     = 32
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + backend_response {
          + body_bytes     = 32
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_request {
          + body_bytes     = 32
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_response {
          + body_bytes     = 32
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }
    }

  # azurerm_api_management_diagnostic.azuremonitor will be created
  + resource "azurerm_api_management_diagnostic" "azuremonitor" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "altinn-apim-test-apim"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "azuremonitor"
      + log_client_ip             = true
      + resource_group_name       = "altinn-apim-test-rg"
      + sampling_percentage       = 0
      + verbosity                 = "information"

      + backend_request {
        }

      + backend_response {
        }

      + frontend_request {
        }

      + frontend_response {
        }
    }

  # azurerm_api_management_logger.apimlogger will be created
  + resource "azurerm_api_management_logger" "apimlogger" {
      + api_management_name = "altinn-apim-test-apim"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "altinn-apim-test-apimlogger"
      + resource_group_name = "altinn-apim-test-rg"

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "altinn-apim-test-appinsights"
      + resource_group_name                 = "altinn-apim-test-rg"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
    }

  # azurerm_container_app.container_app will be updated in-place
  ~ resource "azurerm_container_app" "container_app" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.App/containerApps/altinn-apim-test-hcpyxw-aca"
        name                          = "altinn-apim-test-hcpyxw-aca"
        tags                          = {}
        # (10 unchanged attributes hidden)

      ~ ingress {
            # (8 unchanged attributes hidden)

          ~ traffic_weight {
              ~ latest_revision = false -> true
              - revision_suffix = "6uwkbbg" -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ template {
          ~ max_replicas                     = 10 -> 1
          ~ min_replicas                     = 10 -> 0
            # (2 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-apim-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-apim-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-apim-test-rg.tfstate.tfplan`